solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpuart_cmsis.c
#endif /* LPUART13 */

#if defined(LPUART14) && defined(RTE_USART14) && RTE_USART14

/* User needs to provide the implementation for LPUART14_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART14_GetFreq(void);

static cmsis_lpuart_resource_t LPUART14_Resource = {LPUART14, LPUART14_GetFreq};

#if defined(RTE_USART14_DMA_EN) && RTE_USART14_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART14_DmaResource = {
    RTE_USART14_DMA_TX_DMA_BASE,    RTE_USART14_DMA_TX_CH,          RTE_USART14_DMA_TX_PERI_SEL,
    RTE_USART14_DMA_RX_DMA_BASE,    RTE_USART14_DMA_RX_CH,          RTE_USART14_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART14_DMA_TX_DMAMUX_BASE, RTE_USART14_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART14_DMAMUX_TX_CH,       RTE_USART14_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART14_DmaHandle;
static dma_handle_t LPUART14_DmaRxHandle;
static dma_handle_t LPUART14_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart14_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART14_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART14_DmaDriverState = {
#endif
    &LPUART14_Resource, &LPUART14_DmaResource, &LPUART14_DmaHandle, &LPUART14_DmaRxHandle, &LPUART14_DmaTxHandle,
};

static int32_t LPUART14_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART14_PIN_INIT
    RTE_USART14_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaUninitialize(void)
{
#ifdef RTE_USART14_PIN_DEINIT
    RTE_USART14_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART14_DmaDriverState);
}

static uint32_t LPUART14_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART14_DmaDriverState);
}

static uint32_t LPUART14_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART14_DmaDriverState);
}

static ARM_USART_STATUS LPUART14_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART14_DmaDriverState);
}

/* LPUART14 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART14_EdmaResource = {
    RTE_USART14_DMA_TX_DMA_BASE,    RTE_USART14_DMA_TX_CH,          RTE_USART14_DMA_TX_PERI_SEL,
    RTE_USART14_DMA_RX_DMA_BASE,    RTE_USART14_DMA_RX_CH,          RTE_USART14_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART14_DMA_TX_DMAMUX_BASE, RTE_USART14_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART14_EdmaHandle;
static edma_handle_t LPUART14_EdmaRxHandle;
static edma_handle_t LPUART14_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart14_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART14_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART14_EdmaDriverState = {
#endif
    &LPUART14_Resource, &LPUART14_EdmaResource, &LPUART14_EdmaHandle, &LPUART14_EdmaRxHandle, &LPUART14_EdmaTxHandle,
};

static int32_t LPUART14_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART14_PIN_INIT
    RTE_USART14_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaUninitialize(void)
{
#ifdef RTE_USART14_PIN_DEINIT
    RTE_USART14_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART14_EdmaDriverState);
}

static uint32_t LPUART14_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART14_EdmaDriverState);
}

static uint32_t LPUART14_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART14_EdmaDriverState);
}

static ARM_USART_STATUS LPUART14_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART14_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART14_Handle;

#if defined(USART14_RX_BUFFER_ENABLE) && (USART14_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart14_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart14_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART14_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART14_NonBlockingDriverState = {
#endif
    &LPUART14_Resource,
    &LPUART14_Handle,
};

static int32_t LPUART14_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART14_PIN_INIT
    RTE_USART14_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingUninitialize(void)
{
#ifdef RTE_USART14_PIN_DEINIT
    RTE_USART14_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART14_NonBlockingDriverState);

#if defined(USART14_RX_BUFFER_ENABLE) && (USART14_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART14_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART14_NonBlockingDriverState.resource->base,
                                       LPUART14_NonBlockingDriverState.handle, lpuart14_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART14_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART14_NonBlockingDriverState);
}

static uint32_t LPUART14_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART14_NonBlockingDriverState);
}

static uint32_t LPUART14_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART14_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART14_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART14_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

