solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpuart_cmsis.c
static ARM_USART_STATUS LPUART14_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART14_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART14 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART14_DMA_EN) && RTE_USART14_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART14_EdmaInitialize, LPUART14_EdmaUninitialize, LPUART14_EdmaPowerControl,
                                   LPUART14_EdmaSend,       LPUART14_EdmaReceive,      LPUART14_EdmaTransfer,
                                   LPUART14_EdmaGetTxCount, LPUART14_EdmaGetRxCount,   LPUART14_EdmaControl,
                                   LPUART14_EdmaGetStatus,
#else
                                   LPUART14_DmaInitialize,  LPUART14_DmaUninitialize, LPUART14_DmaPowerControl,
                                   LPUART14_DmaSend,        LPUART14_DmaReceive,      LPUART14_DmaTransfer,
                                   LPUART14_DmaGetTxCount,  LPUART14_DmaGetRxCount,   LPUART14_DmaControl,
                                   LPUART14_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART14_NonBlockingInitialize,
                                  LPUART14_NonBlockingUninitialize,
                                  LPUART14_NonBlockingPowerControl,
                                  LPUART14_NonBlockingSend,
                                  LPUART14_NonBlockingReceive,
                                  LPUART14_NonBlockingTransfer,
                                  LPUART14_NonBlockingGetTxCount,
                                  LPUART14_NonBlockingGetRxCount,
                                  LPUART14_NonBlockingControl,
                                  LPUART14_NonBlockingGetStatus,
#endif /* RTE_USART14_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART14 */

#if defined(LPUART15) && defined(RTE_USART15) && RTE_USART15

/* User needs to provide the implementation for LPUART15_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART15_GetFreq(void);

static cmsis_lpuart_resource_t LPUART15_Resource = {LPUART15, LPUART15_GetFreq};

#if defined(RTE_USART15_DMA_EN) && RTE_USART15_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART15_DmaResource = {
    RTE_USART15_DMA_TX_DMA_BASE,    RTE_USART15_DMA_TX_CH,          RTE_USART15_DMA_TX_PERI_SEL,
    RTE_USART15_DMA_RX_DMA_BASE,    RTE_USART15_DMA_RX_CH,          RTE_USART15_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART15_DMA_TX_DMAMUX_BASE, RTE_USART15_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART15_DMAMUX_TX_CH,       RTE_USART15_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART15_DmaHandle;
static dma_handle_t LPUART15_DmaRxHandle;
static dma_handle_t LPUART15_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart15_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART15_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART15_DmaDriverState = {
#endif
    &LPUART15_Resource, &LPUART15_DmaResource, &LPUART15_DmaHandle, &LPUART15_DmaRxHandle, &LPUART15_DmaTxHandle,
};

static int32_t LPUART15_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART15_PIN_INIT
    RTE_USART15_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART15_DmaDriverState);
}

static int32_t LPUART15_DmaUninitialize(void)
{
#ifdef RTE_USART15_PIN_DEINIT
    RTE_USART15_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART15_DmaDriverState);
}

static int32_t LPUART15_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART15_DmaDriverState);
}

static int32_t LPUART15_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART15_DmaDriverState);
}

static int32_t LPUART15_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART15_DmaDriverState);
}

static int32_t LPUART15_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART15_DmaDriverState);
}

static uint32_t LPUART15_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART15_DmaDriverState);
}

static uint32_t LPUART15_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART15_DmaDriverState);
}

static int32_t LPUART15_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART15_DmaDriverState);
}

static ARM_USART_STATUS LPUART15_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART15_DmaDriverState);
}

/* LPUART15 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART15_EdmaResource = {
    RTE_USART15_DMA_TX_DMA_BASE,    RTE_USART15_DMA_TX_CH,          RTE_USART15_DMA_TX_PERI_SEL,
    RTE_USART15_DMA_RX_DMA_BASE,    RTE_USART15_DMA_RX_CH,          RTE_USART15_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART15_DMA_TX_DMAMUX_BASE, RTE_USART15_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART15_EdmaHandle;
static edma_handle_t LPUART15_EdmaRxHandle;
static edma_handle_t LPUART15_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart15_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART15_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART15_EdmaDriverState = {
#endif
    &LPUART15_Resource, &LPUART15_EdmaResource, &LPUART15_EdmaHandle, &LPUART15_EdmaRxHandle, &LPUART15_EdmaTxHandle,
};

static int32_t LPUART15_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART15_PIN_INIT
    RTE_USART15_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART15_EdmaDriverState);
}

static int32_t LPUART15_EdmaUninitialize(void)
{
#ifdef RTE_USART15_PIN_DEINIT
    RTE_USART15_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART15_EdmaDriverState);
}

