solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpuart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart17_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART17_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART17_EdmaDriverState = {
#endif
    &LPUART17_Resource, &LPUART17_EdmaResource, &LPUART17_EdmaHandle, &LPUART17_EdmaRxHandle, &LPUART17_EdmaTxHandle,
};

static int32_t LPUART17_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART17_PIN_INIT
    RTE_USART17_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART17_EdmaDriverState);
}

static int32_t LPUART17_EdmaUninitialize(void)
{
#ifdef RTE_USART17_PIN_DEINIT
    RTE_USART17_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART17_EdmaDriverState);
}

static int32_t LPUART17_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART17_EdmaDriverState);
}

static int32_t LPUART17_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART17_EdmaDriverState);
}

static int32_t LPUART17_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART17_EdmaDriverState);
}

static int32_t LPUART17_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART17_EdmaDriverState);
}

static uint32_t LPUART17_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART17_EdmaDriverState);
}

static uint32_t LPUART17_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART17_EdmaDriverState);
}

static int32_t LPUART17_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART17_EdmaDriverState);
}

static ARM_USART_STATUS LPUART17_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART17_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART17_Handle;

#if defined(USART17_RX_BUFFER_ENABLE) && (USART17_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart17_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart17_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART17_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART17_NonBlockingDriverState = {
#endif
    &LPUART17_Resource,
    &LPUART17_Handle,
};

static int32_t LPUART17_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART17_PIN_INIT
    RTE_USART17_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART17_NonBlockingDriverState);
}

static int32_t LPUART17_NonBlockingUninitialize(void)
{
#ifdef RTE_USART17_PIN_DEINIT
    RTE_USART17_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART17_NonBlockingDriverState);
}

static int32_t LPUART17_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART17_NonBlockingDriverState);

#if defined(USART17_RX_BUFFER_ENABLE) && (USART17_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART17_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART17_NonBlockingDriverState.resource->base,
                                       LPUART17_NonBlockingDriverState.handle, lpuart17_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART17_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART17_NonBlockingDriverState);
}

static int32_t LPUART17_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART17_NonBlockingDriverState);
}

static int32_t LPUART17_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART17_NonBlockingDriverState);
}

static uint32_t LPUART17_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART17_NonBlockingDriverState);
}

static uint32_t LPUART17_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART17_NonBlockingDriverState);
}

static int32_t LPUART17_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART17_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART17_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART17_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART17_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART17_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART17 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART17_DMA_EN) && RTE_USART17_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART17_EdmaInitialize, LPUART17_EdmaUninitialize, LPUART17_EdmaPowerControl,
                                   LPUART17_EdmaSend,       LPUART17_EdmaReceive,      LPUART17_EdmaTransfer,
                                   LPUART17_EdmaGetTxCount, LPUART17_EdmaGetRxCount,   LPUART17_EdmaControl,
                                   LPUART17_EdmaGetStatus,
#else
                                   LPUART17_DmaInitialize,  LPUART17_DmaUninitialize, LPUART17_DmaPowerControl,
                                   LPUART17_DmaSend,        LPUART17_DmaReceive,      LPUART17_DmaTransfer,
                                   LPUART17_DmaGetTxCount,  LPUART17_DmaGetRxCount,   LPUART17_DmaControl,
                                   LPUART17_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART17_NonBlockingInitialize,
                                  LPUART17_NonBlockingUninitialize,
                                  LPUART17_NonBlockingPowerControl,
                                  LPUART17_NonBlockingSend,
                                  LPUART17_NonBlockingReceive,
                                  LPUART17_NonBlockingTransfer,
                                  LPUART17_NonBlockingGetTxCount,
                                  LPUART17_NonBlockingGetRxCount,
                                  LPUART17_NonBlockingControl,
                                  LPUART17_NonBlockingGetStatus,
#endif /* RTE_USART17_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART17 */

