solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpuart_cmsis.c
static uint32_t LPUART19_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART19_NonBlockingDriverState);
}

static int32_t LPUART19_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART19_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART19_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART19_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART19_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART19_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART19 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART19_DMA_EN) && RTE_USART19_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART19_EdmaInitialize, LPUART19_EdmaUninitialize, LPUART19_EdmaPowerControl,
                                   LPUART19_EdmaSend,       LPUART19_EdmaReceive,      LPUART19_EdmaTransfer,
                                   LPUART19_EdmaGetTxCount, LPUART19_EdmaGetRxCount,   LPUART19_EdmaControl,
                                   LPUART19_EdmaGetStatus,
#else
                                   LPUART19_DmaInitialize,  LPUART19_DmaUninitialize, LPUART19_DmaPowerControl,
                                   LPUART19_DmaSend,        LPUART19_DmaReceive,      LPUART19_DmaTransfer,
                                   LPUART19_DmaGetTxCount,  LPUART19_DmaGetRxCount,   LPUART19_DmaControl,
                                   LPUART19_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART19_NonBlockingInitialize,
                                  LPUART19_NonBlockingUninitialize,
                                  LPUART19_NonBlockingPowerControl,
                                  LPUART19_NonBlockingSend,
                                  LPUART19_NonBlockingReceive,
                                  LPUART19_NonBlockingTransfer,
                                  LPUART19_NonBlockingGetTxCount,
                                  LPUART19_NonBlockingGetRxCount,
                                  LPUART19_NonBlockingControl,
                                  LPUART19_NonBlockingGetStatus,
#endif /* RTE_USART19_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART19 */

#if defined(LPUART20) && defined(RTE_USART20) && RTE_USART20

/* User needs to provide the implementation for LPUART20_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART20_GetFreq(void);

static cmsis_lpuart_resource_t LPUART20_Resource = {LPUART20, LPUART20_GetFreq};

#if defined(RTE_USART20_DMA_EN) && RTE_USART20_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART20_DmaResource = {
    RTE_USART20_DMA_TX_DMA_BASE,    RTE_USART20_DMA_TX_CH,          RTE_USART20_DMA_TX_PERI_SEL,
    RTE_USART20_DMA_RX_DMA_BASE,    RTE_USART20_DMA_RX_CH,          RTE_USART20_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART20_DMA_TX_DMAMUX_BASE, RTE_USART20_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART20_DMAMUX_TX_CH,       RTE_USART20_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART20_DmaHandle;
static dma_handle_t LPUART20_DmaRxHandle;
static dma_handle_t LPUART20_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart20_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART20_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART20_DmaDriverState = {
#endif
    &LPUART20_Resource, &LPUART20_DmaResource, &LPUART20_DmaHandle, &LPUART20_DmaRxHandle, &LPUART20_DmaTxHandle,
};

static int32_t LPUART20_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART20_PIN_INIT
    RTE_USART20_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaUninitialize(void)
{
#ifdef RTE_USART20_PIN_DEINIT
    RTE_USART20_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART20_DmaDriverState);
}

static uint32_t LPUART20_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART20_DmaDriverState);
}

static uint32_t LPUART20_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART20_DmaDriverState);
}

static ARM_USART_STATUS LPUART20_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART20_DmaDriverState);
}

/* LPUART20 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART20_EdmaResource = {
    RTE_USART20_DMA_TX_DMA_BASE,    RTE_USART20_DMA_TX_CH,          RTE_USART20_DMA_TX_PERI_SEL,
    RTE_USART20_DMA_RX_DMA_BASE,    RTE_USART20_DMA_RX_CH,          RTE_USART20_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART20_DMA_TX_DMAMUX_BASE, RTE_USART20_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART20_EdmaHandle;
static edma_handle_t LPUART20_EdmaRxHandle;
static edma_handle_t LPUART20_EdmaTxHandle;

